# Pandas

Pandas - это библиотека для работы с табличными данными.

Как всегда, [официальный сайт](https://pandas.pydata.org/) предоставляет самую актуальную и полезную информацию. Доки по функциям и классам [здесь](https://pandas.pydata.org/pandas-docs/stable/reference/index.html).

Установка pandas как обычно не составляет сложностей:

In [1]:
!pip install pandas==1.0.0

Collecting pandas==1.0.0
  Downloading https://files.pythonhosted.org/packages/12/d1/a6502c2f5c15b50f5dd579fc1c52b47edf6f2e9f682aed917dd7565b3e60/pandas-1.0.0-cp36-cp36m-manylinux1_x86_64.whl (10.1MB)
     |████████████████████████████████| 10.1MB 2.6MB/s
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (1.18.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas==1.0.0) (1.15.0)
ERROR: google-colab 1.0.0 has requirement pandas~=1.1.0; python_version >= "3.0", but you'll have pandas 1.0.0 which is incompatible.
ERROR: fbprophet 0.7.1 has requirement pandas>=1.0.4, but you'll have pandas 1.0.0 which is incompatible.
Installing collected packages: pandas
  Found existing installation: pandas 1.1.2
    Uninstalling pandas-1.1.2:
      Successfully uninstalled pandas-1.1.2
Successfully installed pandas-1.0.0

Импорт библиотеки с устоявшимся сокращением:

In [2]:
import pandas as pd

# Создание объекта таблицы

Начнем с простого создания объекта основного класса в pandas - `DataFrame`. Фреймы в pandas представляют собой двумерные массивы (матрицы) данных. Для применения в машинном обучении визуально можно представить данные следующим образом:

$$
X = 
\begin{bmatrix}
x^{(1)}_1 & \dots & x^{(1)}_{m-1} & x^{(1)}_m \\
x^{(2)}_1 & \dots & x^{(2)}_{m-1} & x^{(2)}_m \\
\vdots & \ddots &  \vdots & \vdots  \\
x^{(n)}_1 & \dots & x^{(n)}_{m-1} & x^{(n)}_m \\
\end{bmatrix}
$$

где $n$ - количество записей (сэмплов/рядов) в данных, $m$ - количество признаков (предикторов/фич) в данных.

> **Признаки** в данных - это те данные, на основе которых производится анализ данных, обучение модели и предсказание. В реальной задаче признаками могут быть "цена", "пол", "группа крови", "текст в заявке" и т.д. [Колонки в таблице]

> **Записи** в данных - сущности, каждая из которых имеет свой набор значений признаков. В базе данных банка это могут быть отдельные транзакции. Все транзакции имеют одинаковые признаки, но значения этих признаков у каждой записи свои. [Строки в таблице]

Создание `DataFrame` возможно разными способами, для начала попробуем создать фрейм из двумерного массива:

In [3]:
import numpy as np

arr = np.random.randint(0, 10, size=(5, 3))
print(arr)

[[8 8 3]
 [6 0 3]
 [3 7 3]
 [6 4 8]
 [2 7 1]]

In [5]:
# Создание фрейма - просто вызвать конструктор
df = pd.DataFrame(data=arr, index=['first','second','third','fourth','fifth'], columns=['some']*3)
# Фреймы удобнее отображать с помощью встроенных средств Jupyter
df

        some  some  some
first      2     9     4
second     8     6     8
third      1     9     6
fourth     2     4     1
fifth      6     1     5

В представленном фрейме важно отметить две особенности:
- Колонки (признаки) имеют имена, но так как мы их (имена) не задали, то они создались автоматически;
- Каждая строка (запись) имеет **уникальный** индекс, тоже создались сами, так как мы не передавали своих индексов.

Для задания имен колонок используется аргумент в конструкторе (DataFrame) `columns`, в который передаеся список имен по количеству признаков. Для задания индексов аргумент `index`, в который передается список индексов по количеству записей в массиве.

## Задание

Создайте фрейм с именами колонок `'col_1', 'col_2', 'col_3'` и индексами по алфавиту (`'A', 'B', 'C', ...` или `'A', 'Б', 'В', ...`).

In [13]:
# TODO
arr = np.random.randint(0, 10, size=(5, 3))
indexes = ["A","B","C","D","E"]
columns = [f'col_{col_number}' for col_number in range(3)]
df = pd.DataFrame(data=arr, index=indexes, columns=columns)
df

   col_0  col_1  col_2
A      5      5      2
B      7      0      0
C      4      5      0
D      1      8      2
E      7      6      7

# Создание фрейма из словарей

Другим способом создания фрейма является конструктор на основе словаря с данными:

In [14]:
# Создается словарь, в котором ключи будут названиями колонок,
#   а значения - данные по этим колонкам
data = {
    'test_1_mark': [4.6, 3.8, 5.0, 4.5],
    'test_2_mark': [5.0, 3.9, 4.7, 4.5]
}

pd.DataFrame(data)

   test_1_mark  test_2_mark
0          4.6          5.0
1          3.8          3.9
2          5.0          4.7
3          4.5          4.5

Альтернативой использования словарей является создание массива словарей:

In [15]:
# Создается список записей, каждая запись представлена словарем
# В словаре ключи - названия колонок
# При создании фрейма pandas просмотри все возможные ключи словарей в списке
#   и создаст колонок по их названиям
data = [
    {
        'test_1_mark': 4.6,
        'test_2_mark': 5.0
    },
    {
        'test_1_mark': 3.8,
        'test_2_mark': 3.9
    },
    {
        'test_1_mark': 5.0
    },
]

pd.DataFrame(data)

   test_1_mark  test_2_mark
0          4.6          5.0
1          3.8          3.9
2          5.0          NaN

Обратите внимание, в одной записи отсутсвовало значение для колонки и во фрейме такое значение обозначено как `NaN`.

> **NaN** (Not a Number) - представление пропусков во фрейме.

Пропуски в данных являение достаточно распространенное. Например, если данные собираются путем анкетирования, то опциональный вопрос может не иметь ответа, поэтому такие записи пропускаются. При разработке моделей машинного обучения с пропусками ведется отдельная работа, но для сырых данных - это нормальное явление.

# Типы данных

Как и в numpy, pandas поддерживает различные типы данных. Для примера создадим фрейм, в котором колонки имеют разные типы данных:

In [23]:
df = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C': np.array([2.] * 4, dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo',
                   'G': ['ghbdtn']*4})
df

     A          B    C  D      E    F       G
0  1.0 2013-01-02  2.0  3   test  foo  ghbdtn
1  1.0 2013-01-02  2.0  3  train  foo  ghbdtn
2  1.0 2013-01-02  2.0  3   test  foo  ghbdtn
3  1.0 2013-01-02  2.0  3  train  foo  ghbdtn

Как видите, создается фрейм, в котором каждая колонка имеет свой тип. Из них для нас имеются два новых типа:
- `Timestamp` - конструктор для временного типа в pandas (`datetime64`);
- `Categorical` - категориальный тип, который в большинстве своем является альтернативой численным данным.

> **Категориальные данные** - данные, значения которых ограничены списком категорий (одно из возможных значений);

> **Численные данные** - данные, которые имеют численное значение (вещественное или целочисленное).

Для просмотра информации о фрейме полезно использовать метод `DataFrame.info()`:

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(2)
memory usage: 388.0+ bytes

Если тип данных не задан явно как категориальный, то строки будут иметь тип `object`, как универсальный тип данных.

# Обзор данных

Начало любого анализа данных происходит с того, что мы должны разобраться, с чем имеем дело, поэтому возможности быстрого обзора данных - то, что нужно:

In [25]:
df = pd.DataFrame(
    data=np.random.randint(-10, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)

# Функция получения первых записей фрейма
# Аргументом задается количество выводимых данных
#   Если не задано - 5 по-умолчанию
df.head(4)

   x1  x2  x3
0   9  -6   4
1   1   9   8
2   9  -4  -1
3   2 -10  -4

In [26]:
# Функция получения последних записей фрейма
# Аргументом задается количество выводимых данных
#   Если не задано - 5 по-умолчанию
df.tail(4)

    x1  x2  x3
11   6 -10   3
12  -1   4  -5
13  -2   4   4
14   6   0  -5

In [27]:
# Функция отображения основной информации о фрейме:
#   Количество записей
#   Типы колонок
#   Количество ненулевых значений
#   Тип индекса
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x1      15 non-null     int64
 1   x2      15 non-null     int64
 2   x3      15 non-null     int64
dtypes: int64(3)
memory usage: 488.0 bytes

In [28]:
# Функция отображения статистики по численным колонкам
# count - количество
# mean - среднее 
# std - standard deviation - стандартное отклонение
# min/max - экстремумы
# 25%/75% квартили 1/4 и 3/4
# 50% квантиль / медиана
df.describe()

              x1         x2         x3
count  15.000000  15.000000  15.000000
mean    1.866667  -0.400000  -1.200000
std     5.792442   5.828501   5.544624
min   -10.000000 -10.000000  -7.000000
25%    -1.500000  -4.500000  -6.000000
50%     2.000000   0.000000  -4.000000
75%     6.000000   4.000000   3.500000
max     9.000000   9.000000   8.000000

In [29]:
# Атрибут получения индексов фрейма
df.index

RangeIndex(start=0, stop=15, step=1)

In [30]:
# Или чтобы представить в виде списка
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [31]:
# Атрибут получения имен колонок фрейма
df.columns

Index(['x1', 'x2', 'x3'], dtype='object')

In [32]:
# Атрибут размерности фрейма
df.shape

(15, 3)

In [33]:
# Преобразование к двумерному массиву numpy
df.to_numpy()

array([[  9,  -6,   4],
       [  1,   9,   8],
       [  9,  -4,  -1],
       [  2, -10,  -4],
       [ -2,   0,  -7],
       [ -8,   7,  -7],
       [  6,  -3,  -7],
       [  3,   1,  -7],
       [  1,  -5,   8],
       [  8,   2,   2],
       [-10,   5,  -4],
       [  6, -10,   3],
       [ -1,   4,  -5],
       [ -2,   4,   4],
       [  6,   0,  -5]])

In [34]:
# Получение транспонированного представления
# Колонки -> ряды, ряды -> колонки
df.T

# (*) Транспонирование вряд ли часто понадобится при анализе, но учитывать стоит

    0  1  2   3  4  5  6  7  8  9  10  11  12  13  14
x1  9  1  9   2 -2 -8  6  3  1  8 -10   6  -1  -2   6
x2 -6  9 -4 -10  0  7 -3  1 -5  2   5 -10   4   4   0
x3  4  8 -1  -4 -7 -7 -7 -7  8  2  -4   3  -5   4  -5

# Обращение к данным

Так как данные представлены в виде двумерного массива, то обращение к ним является важным инструментом.

Начнем с того, чтобы обращаться к конкретной колонке:

In [35]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    columns=['x1', 'x2', 'x3']
)

df

   x1  x2  x3
0   8   9   9
1   1   1   2
2   4   3   3
3   5   2   1
4   4   6   9

In [39]:
print(df['x1'])
print(type(df['x1']))
print(type(df['x1'][0]))

0    8
1    1
2    4
3    5
4    4
Name: x1, dtype: int64
<class 'pandas.core.series.Series'>
<class 'numpy.int64'>

Индексация во фрейме по колонкам производится по имени колонок. В результате создается объект `Series` (ряд), который является одномерным массивом. В случае индексации по колонкам каждая запись в ряду имеет индекс из основного фрейма.

Аналогичный тип данных создается, когда мы обращаемся к конкретной записи в данных. Кстати, просто так не обратиться, поэтому для индексации по записям используются методы `DataFrame.iloc[]` и `DataFrame.loc[]`.

Взгляните на разницу:

In [40]:
data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

   feature1  feature2 feature3
A         0  0.000000   string
B         1  0.714286   string
C         2  1.428571   string
D         3  2.142857   string
E         4  2.857143   string

In [41]:
df.iloc[2]

feature1          2
feature2    1.42857
feature3     string
Name: C, dtype: object

In [42]:
df.loc['C']

feature1          2
feature2    1.42857
feature3     string
Name: C, dtype: object

In [43]:
df.iloc[2, 1]

1.4285714285714286

In [44]:
df.loc['C', 'feature2']

1.4285714285714286

Если разница не явна, то обсудим:
> `.iloc[]` используется для обращения по индексам как рядов, так и колонок;

> `.loc[]` используется для обращения по именованиям как рядов, так и колонок.

В индексации можно применять как слайсы, подобно тем, что научились применять в numpy, так и массивы в качестве индексов.

При индексации по единственной строке создается объект `Series`, но уже с индексами в виде колонок.

## Задание

Выведите часть фрейма со второго ряда по девятый (индексы с 'C' по 'I') и только `feature1` и `feature3`:

In [45]:
data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

   feature1  feature2 feature3
A         0  0.000000   string
B         1  0.714286   string
C         2  1.428571   string
D         3  2.142857   string
E         4  2.857143   string

In [57]:
# TODO - выделите часть фрейма с помощью .loc[]
df.loc[ ['C','D','E','F','G','H', 'I'], ['feature1','feature3']]

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

In [58]:
# TODO - выделите часть фрейма с помощью .iloc[]
df.iloc[range(2,9,1),[0,2]]

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

# Условная индексация

При работе с данными часто необходимо выбрать часть данных по условному признаку. По аналогии с работой в numpy, применение булевых операторов на ряд данных создает такой же по размеру ряд из булевых элементов, представляющих собой маску:

In [59]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   9   4   9
1   7   4   3
2   0   2   4

In [60]:
df['x1'] > 5

0      True
1      True
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
14     True
Name: x1, dtype: bool

После того, как маска получена, можно применить ее, чтобы выбрать конкретные записи (строки) данных. При этом, индексация маской работает как при использовании `[]`, так и при использовании `.loc[]`.

In [61]:
mask = df['x1'] > 5
df[mask]

# Или df[df['x1'] > 5]

    x1  x2  x3
0    9   4   9
1    7   4   3
4    9   4   6
12   6   9   5
14   6   3   4

Чтобы получить значения, обратные условию, можно воспользоваться оператором НЕ: `~` - он инвертирует маску условия:

In [62]:
df[~(df['x1'] > 5)]

    x1  x2  x3
2    0   2   4
3    3   6   2
5    2   0   0
6    4   2   1
7    0   2   1
8    1   6   2
9    1   3   1
10   1   2   0
11   0   6   4
13   2   0   6

> Как и в numpy, для применения нескольких операций необходимо оборачивать каждую в скобки.

## Задание

Выберите записи во фрейме, которые по признаку `x1` имеют значение больше 3, а по признаку `x3` - меньше 8.

In [63]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   9   5   2
1   1   5   6
2   9   9   0

In [94]:
# TODO - отфильтровать фрейм по значениям признаков
first_mask = df['x1'] > 3
second_mask = df['x3'] < 8
df[first_mask & second_mask]

    x1  x2  x3
0    9   5   2
2    9   9   0
3    9   6   7
4    8   3   3
5    7   6   7
9    7   5   3
12   9   6   2
13   8   9   1

In [105]:
# TODO - отобразите только колонки x1 и x2 с учетом условий 
#           (используйте .loc[])
df.loc[df[first_mask & second_mask].index,['x1','x2']]

    x1  x2
0    9   5
2    9   9
3    9   6
4    8   3
5    7   6
9    7   5
12   9   6
13   8   9

## Задание

С помощью метода `DataFrame.query()` получите записи, которые соответсвуют условию сравнения колонок $x1 > x3$:

In [106]:
df = pd.DataFrame(
    [[1, 2, 6], [5, 1, 1], [8, 4, 6], [4, 1, 1], [9, 9, 0], [-1, 2, 1], [5, 5, 5]],
    columns = ['x1', 'x2', 'x3']
)
df

   x1  x2  x3
0   1   2   6
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0
5  -1   2   1
6   5   5   5

In [109]:
# TODO - Методом DataFrame.query() получить записи, удовлетворяющие условию
#           x1 > x3
df.query('x1 > x3')

   x1  x2  x3
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0

In [111]:
# TODO - Сделать аналогичное действие, но уже с помощью условной индексации
df[df['x1'] > df['x3']]

   x1  x2  x3
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0

# Операции с рядами / Новые колонки

Работа с фреймами и рядами данных в pandas поддерживает многие операции по аналогии с работой в numpy.

In [112]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   8   9   0
1   1   1   9
2   0   7   1

In [113]:
# Создать новую колонку можно по аналогии с новым ключем в словаре
# Сложение нескольких Series и запись в новую колонку
df['x1+x2'] = df['x1'] + df['x2']
df.head(3)

   x1  x2  x3  x1+x2
0   8   9   0     17
1   1   1   9      2
2   0   7   1      7

In [114]:
# Поэлементное умножение
df['x1*x3'] = df['x1'] * df['x3']
df.head(3)

   x1  x2  x3  x1+x2  x1*x3
0   8   9   0     17      0
1   1   1   9      2      9
2   0   7   1      7      0

In [115]:
# Взятие среднего по колонке (метод Series.mean())
df['x1'].mean()

3.933333333333333

In [116]:
# Использование функций numpy для работы с колонками
df['x2_exp'] = np.exp(df['x2'])
df.head(3)

   x1  x2  x3  x1+x2  x1*x3       x2_exp
0   8   9   0     17      0  8103.083928
1   1   1   9      2      9     2.718282
2   0   7   1      7      0  1096.633158

Как вы заметили, ряды (это же одномерные массивы) можно обрабатывать:
- операциями Python;
- методами класса Series;
- функциями numpy.

> Для создания новой колонки достаточно просто задать имя новой колонки и записать ряд данных (может быть даже одномерным массивом numpy), который имеет такой же размер, куда пишется.

Для случая, если нужной функции нет, то можно создать свою с помощью метода `Series.apply()`, которой передается название функции для применения над всем рядом.

In [117]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(3, 3)), 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
0   0   3   0
1   4   5   4
2   8   4   5

In [120]:
# Обязательно требование к функции - один аргумент
# Эта функция будет передана в apply() и pandas
#   будет вызывать ее и передавать в нее 
#   по одному элементу из ряда
# Возвращать функция должна результат операции над элементом
def my_func(x):
    print(type(x))
    print(x)
    y = x*2
    return 1

df['result'] = df['x1'].apply(my_func)
df

<class 'int'>
0
<class 'int'>
4
<class 'int'>
8

   x1  x2  x3  result
0   0   3   0       1
1   4   5   4       1
2   8   4   5       1

Как видно, в функцию передается каждый элемент в ряду, тип элемента соответсвует типу колонки. Результат метода `.apply()` - новый ряд с примененной функцией.

# Операции с фреймами

## Переименование колонок / индексов

Одной из полезных функций является возможность переименования имен колонок. Для этого имеется метод `DataFrame.rename()`:

In [121]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   9   6   7
1   8   7   5
2   7   9   8

In [122]:
# Методу передается в аргумент columns словарь, 
#   в котором ключи - имена колонок,
#   значения - новые имена для переименования
df.rename(
    columns={
        'x1': 'new_name_for_x1',
        'x3': 'that_not_x3' 
    },
    inplace=True
)
df.head(3)

   new_name_for_x1  x2  that_not_x3
0                9   6            7
1                8   7            5
2                7   9            8

> Аргумент `inplace` является достаточно распространенным в методах фреймов. Этот аргумент управляет тем, как произвести операцию: прямо в этом классе (при установленном True) или вернуть результатом новый фрейм с произведенной операцией (при установленном False).

Для сравнения аналогичный код без `inplace` выглядел бы так:
```python
df_renamed = df.rename(columns={
    'x1': 'new_name_for_x1',
    'x3': 'that_not_x3'
})
df_renamed
```

Для переименования индексов (названий записей) используется тот же принцип, но словарь передается в аргумент `index` с ключами - исходными названиями индексов, значениями - новыми значениями.

### Задание

Переименуйте индексы и колонки во фрейме

In [123]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    index=['A', 'B', 'C', 'D', 'E'], 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
A   7   5   5
B   4   0   6
C   8   1   3
D   7   9   3
E   4   1   5

In [126]:
# TODO - переименуйте индексы [A, C] -> [indA, indC] 
#           и колонки [x1, x3] -> [new1, new3]
df.rename(
    index={
        'A':'indA',
        'C':'indC'
    },
    columns={
        'x1':'new1',
        'x3':'new3'
    },
    inplace=True
)
df

      new1  x2  new3
indA     7   5     5
B        4   0     6
indC     8   1     3
D        7   9     3
E        4   1     5

## Удаление колонок / строк

Данную операцию можно произвести двумя способами:
1. Выбрать колонки, которые необходимо оставить, простой индексацией;
2. Метод `DataFrame.drop()`.

In [127]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   5   8   3
1   4   6   6
2   6   1   4

In [128]:
df.drop(columns=['x2'], inplace=True)
df.head(3)

   x1  x3
0   5   3
1   4   6
2   6   4

## Определение количества NaN

В данных часто бывают пропуски (NaN), при этом на первых этапах анализа важно понять их количество по каждому признаку. Для этого можно воспользоваться методом `DataFrame.isna()`, который создаст двумерный булевый фрейм, отвечающий на вопрос "является ли значение NaN?". После этого над всем фреймом можно применить метод `DataFrame.sum()`, который вернет ряд (Series) с количеством элементов True в булевом фрейме (элементов NaN в основном фрейме).

In [129]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.iloc[0, :2] = np.nan
df.iloc[2, 1:] = np.nan

df

    x1   x2   x3
0  NaN  NaN  8.0
1  0.0  0.0  5.0
2  5.0  NaN  NaN
3  3.0  1.0  7.0
4  0.0  9.0  6.0

In [130]:
df.isna()

      x1     x2     x3
0   True   True  False
1  False  False  False
2  False   True   True
3  False  False  False
4  False  False  False

In [131]:
df.isna().sum()

x1    1
x2    2
x3    1
dtype: int64

## Заполнение пустых значений

Техники заполнения пустых значений имеют разнообразное представление, но одним из простых методов является заполнение константой. Для этого ряд данных имеет метод `Series.fillna()`, в который можно передать значение и вместо NaN элементов будет поставлена константа, указанная в аргументах.

In [132]:
df

    x1   x2   x3
0  NaN  NaN  8.0
1  0.0  0.0  5.0
2  5.0  NaN  NaN
3  3.0  1.0  7.0
4  0.0  9.0  6.0

In [133]:
df['x2'].fillna(3, inplace=True)
df

    x1   x2   x3
0  NaN  3.0  8.0
1  0.0  0.0  5.0
2  5.0  3.0  NaN
3  3.0  1.0  7.0
4  0.0  9.0  6.0

## Информация об уникальных значениях

При работе с категориальными данными полезна информация об уникальных значения признака, поэтому важно понимать, как проверить их количество:

In [4]:
df = pd.DataFrame({
    'col1': ['high', 'high', 'low', 'med', 'low', 'low', 'med', 'low', 'low', 'high'],
    'col2': [0, 1, 1, 2, 3, 1, 1, 2, 2, 2]
})
df

   col1  col2
0  high     0
1  high     1
2   low     1
3   med     2
4   low     3
5   low     1
6   med     1
7   low     2
8   low     2
9  high     2

In [5]:
# Метод DataFrame.nunique() позволяет вывести 
#   количество уникальных значений в каждой колонке
# Результат - Series с индексами - названиями колонок
df.nunique()

col1    3
col2    4
dtype: int64

In [6]:
# Метод Series.value_counts() показывает уникальные значения в ряду
#   и указывает их количество
df['col1'].value_counts()

low     5
high    3
med     2
Name: col1, dtype: int64

In [7]:
# Результат - Series с индексами - уникальными значениями
df['col2'].value_counts()

2    4
1    4
3    1
0    1
Name: col2, dtype: int64

## Фильтрация

Метод `DataFrame.filter()` позволяет отфильтровать и выбрать только те колонки/записи, котрые соответсвуют условию, заданному в аргументах:

In [8]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['col_one', 'col_two', 'col_three'])
df

        col_one  col_two  col_three
mouse         1        2          3
rabbit        4        5          6

In [9]:
# Отфильтровать по именам колонок
# Аналогично df[['col_one', 'col_three']]
df.filter(items=['col_one', 'col_three'], axis='columns')

        col_one  col_three
mouse         1          3
rabbit        4          6

In [12]:
# Отфильтровать по регулярному выражению
# Оставить только те колонки, которые оканчиваются на букву "o"
df.filter(regex='e$', axis='columns')

        col_one  col_three
mouse         1          3
rabbit        4          6

### Задание

Отфильруйте записи по строке, содержащейся в имени индекса (аргумент `like`):

In [13]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6], [7, 8, 9])),
                  index=['dog in house', 'cat in house', 'pig in farm'],
                  columns=['x1', 'x2', 'x3'])
df

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6
pig in farm    7   8   9

In [18]:
# TODO - отфильтруйте по записям, должны остаться записи, 
#           индекс которых содержит слово "house"
df.filter(like='house', axis='rows')

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6

## Сортировка

Всегда полезно знать, как отсортировать данные, для этого мы воспользуемся методом `DataFrame.sort_values()`:

In [19]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
}, index=['A', 'B', 'C', 'D', 'E', 'F'])
df

  col1  col2  col3 col4
A    A     2     0    a
B    A     1     1    B
C    B     9     9    c
D  NaN     8     4    D
E    D     7     2    e
F    C     4     3    F

In [20]:
# Отсортируем записи колонки col2
# Именно поэтому в axis ставится rows, так как
#   операция производится в колонке по каждому ряду
df.sort_values(by='col2', axis='rows')

  col1  col2  col3 col4
B    A     1     1    B
A    A     2     0    a
F    C     4     3    F
E    D     7     2    e
D  NaN     8     4    D
C    B     9     9    c

### Задание

Отсортируйте данные:

In [21]:
df = pd.DataFrame(
    np.random.randint(0, 20, size=(5, 5)), 
    columns=['col1', 'col2', 'col3', 'col4', 'col5']
)
df

   col1  col2  col3  col4  col5
0    12    18    16     2    14
1     6    14    18     8    13
2    12    15    16    11     8
3    14    17     5     3    18
4     2    17     9     0     4

In [26]:
# TODO - отсортируйте данные индекса 3 по убыванию
df.sort_values(by=3, axis='columns',ascending=False)

   col5  col2  col1  col3  col4
0    14    18    12    16     2
1    13    14     6    18     8
2     8    15    12    16    11
3    18    17    14     5     3
4     4    17     2     9     0

## Разделение данных на категории

В ходе работы с данными часто бывает необходимо диапазон числовой переменной разбить на несколько групп (категорий). Например, заменить числовой диапазон температур воды $[-10; 60]$ на три категории $[низкая, средняя, высокая]$. Для таких целей используется функция `pd.cut()`:

In [27]:
df = pd.DataFrame({
    'temp': [59, 22, -10, 38, 20, 40, 38, 47, 20, 15, 13, 44, 57, 32, 38]
})
df.head()

   temp
0    59
1    22
2   -10
3    38
4    20

In [30]:
# Можно задать свои границы диапазона и названия категорий
# Если планируется три категории, то границ должно быть на одну больше - 
#   так задаются диапазоны для категорий
df['temp_cat'] = pd.cut(
    x=df['temp'],
    bins=[-10, 10, 25, 60],
    labels=['low', 'medium', 'high'],
    # Флаг, чтобы самое левое значение границы входило в первый диапазон
    include_lowest=True
)
df.head()

   temp temp_cat
0    59     high
1    22   medium
2   -10      low
3    38     high
4    20   medium

In [31]:
# Результат разделения имеет категориальный тип
df['temp_cat'].dtype

CategoricalDtype(categories=['low', 'medium', 'high'], ordered=True)

In [32]:
# Можно не задавать имена категориям, тогда он сам их назовет
result_after_cut = pd.cut(
    x=df['temp'],
    bins=[-10, 10, 25, 60],
    include_lowest=True
)
# Взглянем на имена
result_after_cut.unique()

[(25.0, 60.0], (10.0, 25.0], (-10.001, 10.0]]
Categories (3, interval[float64]): [(-10.001, 10.0] < (10.0, 25.0] < (25.0, 60.0]]

In [33]:
# Можно не задавать границы, лишь количество категорий - 
#   разделение будет на категории с одинаковой шириной диапазонов
result_after_cut = pd.cut(
    x=df['temp'],
    bins=3
)
result_after_cut.unique()

[(36.0, 59.0], (13.0, 36.0], (-10.069, 13.0]]
Categories (3, interval[float64]): [(-10.069, 13.0] < (13.0, 36.0] < (36.0, 59.0]]

### Задание

Разделите показатель качества в диапазоне $[0, 100]$ на три группы: плохое $[0-20]$, среднее $(20-45]$, хорошее $(45-85]$, отличное $(85-100]$. Выясните, что происходит со значениями, которые не попадают в диапазоны категорий:

In [34]:
df = pd.DataFrame({
    'quality': [ 7, 67, 21, 38,  2, -2, 79, 22,  5, 31, 77, 72, 23, 64, 99]
})
df.head()

   quality
0        7
1       67
2       21
3       38
4        2

In [53]:
# TODO - разделите данные на категории
df['quality_cat'] = pd.cut(
    df['quality'],
    bins=[0,20,45,85,100],
    labels=['плохо', 'средне','хорошо','отлично']
)
df.head()
# TODO - определите, какие записи не имеют категорий и почему
df[df['quality_cat'].isna()] # -2 is outside of our bins

   quality quality_cat
5       -2         NaN

## Агрегация данных

Агрегация данных - объединение группы данных для получения информации. Примерами операций аргегации являются: сумма, среднее, максимум, минимум.

В pandas агрегация может быть выполнена путем метода `DataFrame.aggregate()`:

In [54]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [55]:
# Получим значения минимумов и средних по всем колонкам
# Принцип аналогичен операциям в numpy - 
#   для агрегации по колонка операция должна пройти по рядам,
#   соответсвенно, axis='rows'
df.aggregate(['min', 'mean'], axis='rows')

        A    B    C
min   1.0  2.0  3.0
mean  4.0  5.0  6.0

In [56]:
# Зададим правила агрегации для каждой колонки
# Операции можно задавать строками или функциями numpy
df.aggregate({
    'A': ['sum', 'min'],
    'B': ['max', 'min'],
    'C': [np.sum, np.mean],
})

         A    B     C
max    NaN  8.0   NaN
mean   NaN  NaN   6.0
min    1.0  2.0   NaN
sum   12.0  NaN  18.0

### Задание

Произведите агрегацию средним по рядам

In [57]:
df = pd.DataFrame(
    ([1, 2, 3], [4, 5, 6], [7, 8, 9]), 
    columns=['x1', 'x2', 'x3'])
df

   x1  x2  x3
0   1   2   3
1   4   5   6
2   7   8   9

In [58]:
# TODO - произведите агрегацию по рядам (найти среднее)
df.aggregate(np.mean,axis='columns')

0    2.0
1    5.0
2    8.0
dtype: float64

## Группировки

Игры закончились - начались серьезные вещи. Группировки это один из сильнейших инструментов, которые позволяют вытаскивать из данных полезную информацию!

Для понимания разберем пример: допустим, у нас есть база данных студентов с 1 по 4 курсы. Одна из колонок будет иметь в качестве значения номер курса и так как количество допустимых значений ограничено - то правильно считать эту колонку категориальной. Другая колонка - оценка за общий университетский тест (все курсы его проходили). Третьей колонкой будет время выполнения:

In [59]:
data = [
    [1, 4.7, 60],
    [3, 4.5, 45],
    [4, 4.8, 40],
    [1, 4.9, 58],
    [2, 4.1, 50],
    [2, 4.2, 49],
    [2, 4.4, 49],
    [3, 4.9, 46],
    [4, 4.3, 33],
]

stud_df = pd.DataFrame(data, columns=['Grade', 'Test_Mark', 'Time'])
stud_df

   Grade  Test_Mark  Time
0      1        4.7    60
1      3        4.5    45
2      4        4.8    40
3      1        4.9    58
4      2        4.1    50
5      2        4.2    49
6      2        4.4    49
7      3        4.9    46
8      4        4.3    33

Теперь представим, что мы сложим каждый курс в свою корзинку путем группировки:

In [60]:
gr_stud_df = stud_df.groupby(by='Grade')

# Тип результата - pd.DataFrameGroupBy
print(type(gr_stud_df))

# Таким образом увидим словарь:
#   Ключи - названия групп
#   Значения - индексы из данных для группы
gr_stud_df.groups

pandas.core.groupby.generic.DataFrameGroupBy

{1: [0, 3], 2: [4, 5, 6], 3: [1, 7], 4: [2, 8]}

После того, как мы сложили записи по группам, мы можем вычислить, например, среднее значение в каждой группе:

In [61]:
gr_stud_df.agg('mean')

       Test_Mark       Time
Grade
1       4.800000  59.000000
2       4.233333  49.333333
3       4.700000  45.500000
4       4.550000  36.500000

В результате, мы смогли вычислить среднюю оценку за тест по каждому курсу! И для этого нам потребовалось всего два метода! Ручным вариантом нам бы пришлось создавать контейнеры, складывать в них значения и потом вычислять средние значения...

Резюмируя, группировка - это размещение данных по группам уникальных значений признака, по которому группируется. После группировки можно произвести агрегацию данных в каждой группе.

In [62]:
# Более сложный вариант - найдем средние и минимальные время и оценку 

gr_stud_df.agg(['mean', 'min'])

      Test_Mark            Time
           mean  min       mean min
Grade
1      4.800000  4.7  59.000000  58
2      4.233333  4.1  49.333333  49
3      4.700000  4.5  45.500000  45
4      4.550000  4.3  36.500000  33

In [63]:
# Или зададим правила для каждого признака по отдельности

res = gr_stud_df.agg({
    'Test_Mark': ['mean', 'min'],
    'Time': ['min']
})

print(type(res))
res

<class 'pandas.core.frame.DataFrame'>

      Test_Mark      Time
           mean  min  min
Grade
1      4.800000  4.7   58
2      4.233333  4.1   49
3      4.700000  4.5   45
4      4.550000  4.3   33

In [64]:
# Для обращения к данным просто используем несколько индексов, 
#   так как это DataFrame
res['Test_Mark']['mean']

Grade
1    4.800000
2    4.233333
3    4.700000
4    4.550000
Name: mean, dtype: float64

### Задание

Сгруппируйте данные по признаку x2 и найдите медиану и максимальное значения по признакам x1, x3:

In [65]:
df = pd.DataFrame({
    'x1': np.random.randint(10, 100, size=(200, )),
    'x2': np.random.choice(['low', 'high', 'medium'], size=(200, )),
    'x3': np.random.randint(-20, 30, size=(200, )),
})
df.head()

   x1      x2  x3
0  72    high -19
1  87  medium  13
2  53     low  25
3  89    high  -3
4  35     low  -7

In [70]:
# TODO - произведите групировку данных
#           и получите средние и максимальные значения по каждой группе
rank_df = df.groupby(by='x2')
rank_df.agg(['min','mean','max'])

        x1                 x3
       min       mean max min      mean max
x2
high    11  55.500000  97 -20  3.196429  29
low     11  53.935897  95 -20  0.602564  28
medium  12  54.287879  99 -19  2.939394  29

# Сохранение / загрузка данных (работа с CSV)

Одним из важных инструментов в работе с таблицами является возможность сохранить результаты работы в файл или загрузить данные из файла. Пользоваться мы будем форматом CSV, который является текстовым форматом для хранения таблицы. Формат представляет собой текстовые строки, каждая колонка разделяется разделителем (запятая, точка запятой и др.), поэтому его просто понять и обрабатывать, так как не требуется никакого специального протокола для понимания.

Для сохранения данных имеется метод `DataFrame.to_csv()`:

In [71]:
import string

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)
df.head(3)

   x1  x2  x3
A   0   0   5
B   7   0   2
C   2   6   6

In [72]:
# Для сохранения задается путь до файла
df.to_csv('my_first_file.csv')

Чтобы убедиться в работе метода найдите файл рядом с ноутбуком и откройте его через редактор.

> При работе в Google Colab слева есть вкладка, которая показывает файлы на сервере.

При открытии можно увидеть четыре колонки:
- Колонка индекса;
- Три колонки из наших данных.

Теперь, когда мы имеем файл CSV в системе - можем испытать функцию загрузки `pd.read_csv()`:

In [73]:
df = pd.read_csv('my_first_file.csv')
df.head(3)

  Unnamed: 0  x1  x2  x3
0          A   0   0   5
1          B   7   0   2
2          C   2   6   6

Видна одна явная проблема - у нас появилась колонка, которая должна быть индексом, но она стала новой колонкой, а индексы создались новые. Для решения проблемы при загрузке необходимо явно задать, какая колонка считается индексом:

In [74]:
df = pd.read_csv('my_first_file.csv', index_col=0)
df.head(3)

   x1  x2  x3
A   0   0   5
B   7   0   2
C   2   6   6

Теперь все отлично и данные загрузились так, как они должны быть.

## Задание

Разберитесь в аргументах `DataFrame.to_csv()` и сохраните данные в файл так, чтобы в файл индекс не сохранялся.

In [82]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)
df.head(3)
df.to_csv('no_index.csv',index=False)
# TODO - сохранить в файл no_index.csv без индексов

# Задачки

Создайте фрейм с тремя колонками:
- Колонка с именами (тип - объекты);
- Колонка с стажем работы (тип - вещественный);
- Колонка с возрастом (тип - целочисленный);
- Колонка с названием любимого цвета (тип - категориальный);

Имена колонок и значения любые, не менее трех записей (строк) в фрейме.

In [ ]:
# TODO - создайте фрейм и настройте правильные типы колонок
#           DataFrame.info() дожен отображать указанные типы

Выберите числа в ряду `ds1`, которых нет в ряду `ds2`:

> Почитайте и примение метод `Series.isin()`

In [ ]:
ds1 = pd.Series([1, 2, 3, 4, 5])
ds2 = pd.Series([4, 5, 6, 7, 8, 1, 9])

# TODO - выберите значения в ds1, которых нет в ds2: 
# [2, 3]

Оставьте в ряду два наиболее частых значения, остальные замените значением 'Другое':

<details>
<summary>Подсказка 1</summary>

Для определения наиболее частых значений воспользуйтесь методом `Series.value_counts()`
</details>

<details>
<summary>Подсказка 2</summary>

Чтобы получить наиболее частые значения можно воспользоваться результатом `Series.value_counts()` - атрибутом `Series.index`
</details>

<details>
<summary>Подсказка 3</summary>

Получив наиболее частые значения, можно индексировать другие через маску метода `Series.isin()`
</details>

In [ ]:
ds = pd.Series([2, 2, 2, 4, 4, 4, 3, 1, 1, 1, 1, 4])

# TODO - определите два наиболее частых значения в ряду (1, 4),
#           остальные замените значением 'Другое'
# ['Другое', 'Другое', 'Другое', 4, 4, 4, 'Другое', 1, 1, 1, 1, 4]

Сделайте каждую первую букву в словах ряда заглавной:

In [ ]:
ds = pd.Series(['how', 'to', 'use', 'pandas?'])

# TODO - сделайте каждую первую букву заглавной с помощью Series.apply()

Выберите записи с максимальным значением по колонке `x1`:

In [ ]:
df = pd.DataFrame(
    np.random.randint(0, 4, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)

# TODO - выберите те записи, которые имеют x1 равный 
#           максимальному значению в колонке x1

Выведите количество пропусков в каждой колонке данных:

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - отобразите количество пропусков в данных по каждой колонке

Замените пропущенные значения в колонке `Min.Price` средним значениям по этой колонке:

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - заполните NaN в колонке Min.Price средним значением по этой колонке
# NOTE - после заполнения убедитесь, что в этой колонке нет пропущенных

Отсортируйте и выведите фрейм с колонками в алфавитном порядке:

In [ ]:
df = pd.DataFrame(np.random.randint(0, 10, size=(5, 6)), columns=list('fbecda'))

# TODO - получите фрейм с отсортированными по именам колонкам (f e d c b a)
# NOTE - сортировка должна быть автоматической

Отобразите каждую 20ю запись во фрейме и только колонки `Manufacturer`, `Model`, `Type`:

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - отобразите запись с периодичностью во фрейме и определенные колонки

Получите ряд, который содержит длины строк:

In [ ]:
ds = pd.Series(['how', 'to', 'use', 'pandas?'])

# TODO - создайте ряд, содержащий длины строк:
# 0    3
# 1    2
# 2    3
# 3    7
# dtype: int64